---
kind: property
id: P:Autodesk.Revit.DB.TemporaryViewModes.CustomTitle
source: html/9e59ad90-ea34-b2ee-6893-cd425aadb90f.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.CustomTitle Property

Custom title for the TemporaryViewProperties mode.

## Syntax (C#)
```csharp
public string CustomTitle { get; set; }
```

## Remarks
If custom title is not empty, Temporary View Properties mode displays it in the upper left corner of colored view frame.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null